Revit 2027 API
LoadCombinationState Enumeration
 Specifies load combination state.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LoadCombinationState
Public Enumeration LoadCombinationState
public enum class LoadCombinationState
type LoadCombinationState
Members
Member name | Value | Description
Accidental | 5 |  Accidental
Serviceability | 0 |  Serviceability
ServiceabilityFrequent | 3 |  Serviceability Frequent
ServiceabilityQuasiPermanent | 2 |  Serviceability Quasi-permanent
ServiceabilityRare | 4 |  Serviceability Rare
Special | 6 |  Special
Ultimate | 1 |  Ultimate
See Also
Reference
Autodesk.Revit.DB.Structure Namespace